thangtk21/STM32-Projects/Ignition Coil/Rev1/Receive_data_source/Src/main.c

/**
  ******************************************************************************
    @file           : main.c
    @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
    that are not between comment pairs USER CODE BEGIN and
    USER CODE END. Other portions of this file, whether
    inserted by the user or by software development tools
    are owned by their respective copyright owners.

    COPYRIGHT(c) 2019 STMicroelectronics

    Redistribution and use in source and binary forms, with or without modification,
    are permitted provided that the following conditions are met:
      1. Redistributions of source code must retain the above copyright notice,
         this list of conditions and the following disclaimer.
      2. Redistributions in binary form must reproduce the above copyright notice,
         this list of conditions and the following disclaimer in the documentation
         and/or other materials provided with the distribution.
      3. Neither the name of STMicroelectronics nor the names of its contributors
         may be used to endorse or promote products derived from this software
         without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
    IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
    FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
    DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
    CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
    OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

  ******************************************************************************
*/
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"

/* USER CODE BEGIN Includes */
#define pattern_a 1
#define pattern_b 0
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
CanRxMsgTypeDef CanRx;
CAN_FilterConfTypeDef sFilterConfig;
uint8_t can_rx_int1 = 0;
uint8_t can_rx_int2 = 0;
uint8_t can_rx_int3 = 0;
uint8_t can_rx_int4 = 0;

//package 1
uint8_t n1, n2;
uint16_t B, C, D;
uint8_t B_H, B_L, C_H, C_L, D_H, D_L;

//package 2
uint16_t B1, C1, B2;
uint8_t B1_H, B1_L, C1_H, C1_L, B2_H, B2_L;

//package 3
uint16_t D1;
uint32_t E;
uint8_t D1_H, D1_L, E_HH, E_H, E_L;

//package 4
uint16_t D2, C2;
uint8_t D2_H, D2_L, C2_H, C2_L;
uint8_t choose_mode;

uint8_t flag_in1_falling_a_tim1 = 0;
uint8_t flag_in1_falling_b_tim1 = 0;
uint8_t flag_in1_rising_a_tim1 = 0;
uint8_t flag_in1_rising_b_tim1 = 0;
uint8_t flag_in1_falling_a_tim2 = 0;
uint8_t flag_in1_falling_b_tim2 = 0;
uint8_t flag_in1_rising_a_tim2 = 0;
uint8_t flag_in1_rising_b_tim2 = 0;

uint8_t flag_in2_falling_a_tim1 = 0;
uint8_t flag_in2_falling_b_tim1 = 0;
uint8_t flag_in2_rising_a_tim1 = 0;
uint8_t flag_in2_rising_b_tim1 = 0;
uint8_t flag_in2_falling_a_tim2 = 0;
uint8_t flag_in2_falling_b_tim2 = 0;
uint8_t flag_in2_rising_a_tim2 = 0;
uint8_t flag_in2_rising_b_tim2 = 0;

uint8_t flag_in3_falling_a_tim1 = 0;
uint8_t flag_in3_falling_b_tim1 = 0;
uint8_t flag_in3_rising_a_tim1 = 0;
uint8_t flag_in3_rising_b_tim1 = 0;
uint8_t flag_in3_falling_a_tim2 = 0;
uint8_t flag_in3_falling_b_tim2 = 0;
uint8_t flag_in3_rising_a_tim2 = 0;
uint8_t flag_in3_rising_b_tim2 = 0;

uint8_t flag_in4_falling_a_tim1 = 0;
uint8_t flag_in4_falling_b_tim1 = 0;
uint8_t flag_in4_rising_a_tim1 = 0;
uint8_t flag_in4_rising_b_tim1 = 0;
uint8_t flag_in4_falling_a_tim2 = 0;
uint8_t flag_in4_falling_b_tim2 = 0;
uint8_t flag_in4_rising_a_tim2 = 0;
uint8_t flag_in4_rising_b_tim2 = 0;



uint16_t counter_out1a_tim1 = 0;
uint16_t counter_out1b_tim1_before = 0;
uint16_t counter_out1b_tim1_after = 0;
uint16_t counter_out1a_tim2 = 0;
uint16_t counter_out1b_tim2 = 0;

uint16_t counter_out2a_tim1 = 0;
uint16_t counter_out2b_tim1_before = 0;
uint16_t counter_out2b_tim1_after = 0;
uint16_t counter_out2a_tim2 = 0;
uint16_t counter_out2b_tim2 = 0;

uint16_t counter_out3a_tim1 = 0;
uint16_t counter_out3b_tim1_before = 0;
uint16_t counter_out3b_tim1_after = 0;
uint16_t counter_out3a_tim2 = 0;
uint16_t counter_out3b_tim2 = 0;

uint16_t counter_out4a_tim1 = 0;
uint16_t counter_out4b_tim1_before = 0;
uint16_t counter_out4b_tim1_after = 0;
uint16_t counter_out4a_tim2 = 0;
uint16_t counter_out4b_tim2 = 0;

uint8_t n1_times_tim1_in1 = 0;
uint8_t n2_times_tim1_in1 = 0;
uint8_t n1_times_tim2_in1 = 0;
uint8_t n2_times_tim2_in1 = 0;

uint8_t n1_times_tim1_in2 = 0;
uint8_t n2_times_tim1_in2 = 0;
uint8_t n1_times_tim2_in2 = 0;
uint8_t n2_times_tim2_in2 = 0;

uint8_t n1_times_tim1_in3 = 0;
uint8_t n2_times_tim1_in3 = 0;
uint8_t n1_times_tim2_in3 = 0;
uint8_t n2_times_tim2_in3 = 0;

uint8_t n1_times_tim1_in4 = 0;
uint8_t n2_times_tim1_in4 = 0;
uint8_t n1_times_tim2_in4 = 0;
uint8_t n2_times_tim2_in4 = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CAN_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
static void CAN_FilterConfig(void);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

