thangtk21/STM32-Projects/Ignition Coil/Rev1/Receive_data_source/Src/main.c
/* USER CODE END 0 */

/**
    @brief  The application entry point.

    @retval None
*/
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CAN_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */


  hcan.pRxMsg = &CanRx;
  CAN_FilterConfig();
  if (HAL_CAN_Receive_IT(&hcan, CAN_FIFO0) != HAL_OK)
  {
    Error_Handler();
  }
  HAL_NVIC_DisableIRQ(in1_falling_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in1_rising_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in2_falling_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in2_rising_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in3_falling_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in3_rising_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in4_falling_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in4_rising_EXTI_IRQn);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    if (can_rx_int1 == 1 && can_rx_int2 == 1 && can_rx_int3 == 1 && can_rx_int4 == 1)
    {
      __HAL_GPIO_EXTI_CLEAR_IT(in1_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in1_rising_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in2_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in2_rising_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in3_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in3_rising_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in4_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in4_rising_Pin);

      HAL_NVIC_EnableIRQ(in1_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in1_rising_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in2_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in2_rising_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in3_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in3_rising_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in4_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in4_rising_EXTI_IRQn);

      can_rx_int1 = 0;
      can_rx_int2 = 0;
      can_rx_int3 = 0;
      can_rx_int4 = 0;

      //n1 = n1,n2 = n2
      B = (B_H << 8) | B_L;
      C = (C_H << 8) | C_L;
      D = (D_H << 8) | D_L;

      B1 = (B1_H << 8) | B1_L;
      C1 = (C1_H << 8) | C1_L;
      B2 = (B2_H << 8) | B2_L;

      D1 = (D1_H << 8) | D1_L;
      E = (E_HH << 16) | (E_H << 8) | E_L;

      D2 = (D2_H << 8) | D2_L;
      C2 = (C2_H << 8) | C2_L;
      //choose_mode = choose_mode

    }
    if (choose_mode == pattern_a)
    {
      HAL_TIM_Base_Start_IT(&htim1);
      HAL_TIM_Base_Stop_IT(&htim2);
    }
    if (choose_mode == pattern_b)
    {
      HAL_TIM_Base_Start_IT(&htim2);
      HAL_TIM_Base_Stop_IT(&htim1);
    }
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
    @brief System Clock Configuration
    @retval None
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

  /**Initializes the CPU, AHB and APB busses clocks
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  /**Initializes the CPU, AHB and APB busses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_TIM1;
  PeriphClkInit.Tim1ClockSelection = RCC_TIM1CLK_HCLK;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  /**Configure the Systick interrupt time
  */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);

  /**Configure the Systick
  */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* CAN init function */
static void MX_CAN_Init(void)
{

  hcan.Instance = CAN;
  hcan.Init.Prescaler = 400;
  hcan.Init.Mode = CAN_MODE_NORMAL;
  hcan.Init.SJW = CAN_SJW_1TQ;
  hcan.Init.BS1 = CAN_BS1_12TQ;
  hcan.Init.BS2 = CAN_BS2_5TQ;
  hcan.Init.TTCM = DISABLE;
  hcan.Init.ABOM = DISABLE;
  hcan.Init.AWUM = DISABLE;
  hcan.Init.NART = DISABLE;
  hcan.Init.RFLM = DISABLE;
  hcan.Init.TXFP = DISABLE;
  if (HAL_CAN_Init(&hcan) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/* TIM1 init function */
static void MX_TIM1_Init(void)
{

  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim1.Instance = TIM1;
  htim1.Init.Prescaler = 8;
  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim1.Init.Period = 79;
  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim1.Init.RepetitionCounter = 0;
  htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

