thangtk21/STM32-Projects/Ignition Coil/Rev1/Receive_data_source/Src/main.c
}

/* TIM2 init function */
static void MX_TIM2_Init(void)
{

  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim2.Instance = TIM2;
  htim2.Init.Prescaler = 8;
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim2.Init.Period = 79;
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/** Configure pins as
          Analog
          Input
          Output
          EVENT_OUT
          EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, out4b_Pin | out4a_Pin | out3b_Pin | out3a_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, out2b_Pin | out2a_Pin | out1b_Pin | out1a_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : in1_rising_Pin in2_rising_Pin in3_rising_Pin in4_rising_Pin */
  GPIO_InitStruct.Pin = in1_rising_Pin | in2_rising_Pin | in3_rising_Pin | in4_rising_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : in4_falling_Pin in3_falling_Pin */
  GPIO_InitStruct.Pin = in4_falling_Pin | in3_falling_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : in2_falling_Pin in1_falling_Pin */
  GPIO_InitStruct.Pin = in2_falling_Pin | in1_falling_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : out4b_Pin out4a_Pin out3b_Pin out3a_Pin */
  GPIO_InitStruct.Pin = out4b_Pin | out4a_Pin | out3b_Pin | out3a_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : out2b_Pin out2a_Pin out1b_Pin out1a_Pin */
  GPIO_InitStruct.Pin = out2b_Pin | out2a_Pin | out1b_Pin | out1a_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

  HAL_NVIC_SetPriority(EXTI1_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI1_IRQn);

  HAL_NVIC_SetPriority(EXTI2_TSC_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI2_TSC_IRQn);

  HAL_NVIC_SetPriority(EXTI3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI3_IRQn);

  HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}

/* USER CODE BEGIN 4 */
//---------------------------------------------------------------------------------------------------Enable Can Receive
void RxIntEnable(CAN_HandleTypeDef *CanHandle)
{
  if (CanHandle->State == HAL_CAN_STATE_BUSY_TX)
    CanHandle->State = HAL_CAN_STATE_BUSY_TX_RX0;
  else
  {
    CanHandle->State = HAL_CAN_STATE_BUSY_RX0;
    CanHandle->ErrorCode = HAL_CAN_ERROR_NONE;
    __HAL_CAN_ENABLE_IT(CanHandle, CAN_IT_EWG);
    __HAL_CAN_ENABLE_IT(CanHandle, CAN_IT_EPV);
    __HAL_CAN_ENABLE_IT(CanHandle, CAN_IT_BOF);
    __HAL_CAN_ENABLE_IT(CanHandle, CAN_IT_LEC);
    __HAL_CAN_ENABLE_IT(CanHandle, CAN_IT_ERR);
  }
  __HAL_CAN_ENABLE_IT(CanHandle, CAN_IT_FMP0);
}
//---------------------------------------------------------------------------------------------------Init Can Filter
static void CAN_FilterConfig(void)
{
  sFilterConfig.BankNumber = 14;
  sFilterConfig.FilterActivation = ENABLE;
  sFilterConfig.FilterFIFOAssignment = CAN_FILTER_FIFO0;
  sFilterConfig.FilterIdHigh = 0;
  sFilterConfig.FilterIdLow = 0;
  sFilterConfig.FilterMaskIdHigh = 0;
  sFilterConfig.FilterMaskIdLow = 0;
  sFilterConfig.FilterMode = CAN_FILTERMODE_IDMASK;
  sFilterConfig.FilterNumber = 0;
  sFilterConfig.FilterScale = CAN_FILTERSCALE_32BIT;
  if (HAL_CAN_ConfigFilter(&hcan, &sFilterConfig) != HAL_OK)
  {
    Error_Handler();
  }
}
//---------------------------------------------------------------------------------------------------Can Receive Interrupt
void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef* CanHandle)
{
  if (CanHandle->pRxMsg->StdId == 0x101)
  {
    can_rx_int1 = 1;
    n1 = CanHandle->pRxMsg->Data[0];
    n2 = CanHandle->pRxMsg->Data[1];
    B_H = CanHandle->pRxMsg->Data[2];
    B_L = CanHandle->pRxMsg->Data[3];
    C_H = CanHandle->pRxMsg->Data[4];
    C_L = CanHandle->pRxMsg->Data[5];
    D_H = CanHandle->pRxMsg->Data[6];
    D_L = CanHandle->pRxMsg->Data[7];
  }
  if (CanHandle->pRxMsg->StdId == 0x102)
  {
    can_rx_int2 = 1;
    B1_H = CanHandle->pRxMsg->Data[0];
    B1_L = CanHandle->pRxMsg->Data[1];
    C1_H = CanHandle->pRxMsg->Data[2];
    C1_L = CanHandle->pRxMsg->Data[3];
    B2_H = CanHandle->pRxMsg->Data[4];
    B2_L = CanHandle->pRxMsg->Data[5];
  }
  if (CanHandle->pRxMsg->StdId == 0x103)
  {
    can_rx_int3 = 1;
    D1_H = CanHandle->pRxMsg->Data[0];
    D1_L = CanHandle->pRxMsg->Data[1];
    E_HH = CanHandle->pRxMsg->Data[2];
    E_H = CanHandle->pRxMsg->Data[3];
    E_L = CanHandle->pRxMsg->Data[4];
  }
  if (CanHandle->pRxMsg->StdId == 0x104)
  {
    can_rx_int4 = 1;
    D2_H = CanHandle->pRxMsg->Data[0];
    D2_L = CanHandle->pRxMsg->Data[1];
    C2_H = CanHandle->pRxMsg->Data[2];
    C2_L = CanHandle->pRxMsg->Data[3];
    choose_mode = CanHandle->pRxMsg->Data[4];
  }
  RxIntEnable(&hcan);
}
//---------------------------------------------------------------------------------------------------External Interrupt
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if (GPIO_Pin == in1_rising_Pin)
  {
    flag_in1_rising_a_tim1 = 1;
    flag_in1_rising_b_tim1 = 1;
    flag_in1_rising_a_tim2 = 1;
    flag_in1_rising_b_tim2 = 1;
    HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
  }
  if (GPIO_Pin == in1_falling_Pin)
  {
    flag_in1_falling_a_tim1 = 1;
    flag_in1_falling_b_tim1 = 1;
    flag_in1_falling_a_tim2 = 1;
    flag_in1_falling_b_tim2 = 1;
    HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
  }
  if (GPIO_Pin == in2_rising_Pin)
  {
    flag_in2_rising_a_tim1 = 1;
    flag_in2_rising_b_tim1 = 1;
    flag_in2_rising_a_tim2 = 1;
    flag_in2_rising_b_tim2 = 1;
    HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
  }
  if (GPIO_Pin == in2_falling_Pin)
  {
    flag_in2_falling_a_tim1 = 1;
    flag_in2_falling_b_tim1 = 1;
    flag_in2_falling_a_tim2 = 1;
    flag_in2_falling_b_tim2 = 1;
    HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
  }
  if (GPIO_Pin == in3_rising_Pin)
  {
    flag_in3_rising_a_tim1 = 1;
    flag_in3_rising_b_tim1 = 1;
    flag_in3_rising_a_tim2 = 1;
    flag_in3_rising_b_tim2 = 1;
    HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 1);
  }
  if (GPIO_Pin == in3_falling_Pin)
  {
    flag_in3_falling_a_tim1 = 1;
    flag_in3_falling_b_tim1 = 1;
    flag_in3_falling_a_tim2 = 1;
    flag_in3_falling_b_tim2 = 1;
    HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 0);
  }
  if (GPIO_Pin == in4_rising_Pin)
  {
    flag_in4_rising_a_tim1 = 1;
    flag_in4_rising_b_tim1 = 1;
    flag_in4_rising_a_tim2 = 1;
    flag_in4_rising_b_tim2 = 1;
    HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 1);
  }
  if (GPIO_Pin == in4_falling_Pin)
  {
    flag_in4_falling_a_tim1 = 1;
    flag_in4_falling_b_tim1 = 1;
    flag_in4_falling_a_tim2 = 1;
    flag_in4_falling_b_tim2 = 1;
    HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 0);
  }
}
//---------------------------------------------------------------------------------------------------Timer Interrupt
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  //--------------------------------------------------------------------------Timer 1
  if (htim->Instance == TIM1)
  {
    //-----------------------------------------------------------channel 1
    //------------------------------------------output 1a
    if (flag_in1_falling_a_tim1 == 1)
    {
      if (counter_out1a_tim1 < B / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
      }
      if (counter_out1a_tim1 >= B / 10 && counter_out1a_tim1 < (B + C) / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
      }
      if (counter_out1a_tim1 == (B + C) / 10)
      {
        counter_out1a_tim1 = UINT16_MAX;
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
        n1_times_tim1_in1++;
      }
      counter_out1a_tim1++;
      if (n1_times_tim1_in1 == n1)
      {
        counter_out1a_tim1 = 0;
        n1_times_tim1_in1 = 0;
        flag_in1_falling_a_tim1 = 0;
      }
    }
    //------------------------------------------output 1b
    if (flag_in1_rising_b_tim1 == 1)
    {
      if (counter_out1b_tim1_before < D / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim1_before == D / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
        counter_out1b_tim1_before = UINT16_MAX;
        flag_in1_rising_b_tim1 = 0;
      }
      counter_out1b_tim1_before++;
    }
    if (flag_in1_falling_b_tim1 == 1)
    {
      if (counter_out1b_tim1_after < D / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim1_after >= D / 10 && counter_out1b_tim1_after < (D + B) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim1_after >= (D + B) / 10 && counter_out1b_tim1_after < (D + B + C) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim1_after == (D + B + C) / 10)
      {
        counter_out1b_tim1_after = D / 10 - 1;
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
        n2_times_tim1_in1++;
      }
      counter_out1b_tim1_after++;
      if (n2_times_tim1_in1 == n2)
      {
        counter_out1b_tim1_after = 0;
        n2_times_tim1_in1 = 0;
        flag_in1_falling_b_tim1 = 0;
      }
    }
    //-----------------------------------------------------------channel 2
    //------------------------------------------output 2a
    if (flag_in2_falling_a_tim1 == 1)
    {
      if (counter_out2a_tim1 < B / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
      }
      if (counter_out2a_tim1 >= B / 10 && counter_out2a_tim1 < (B + C) / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
      }
      if (counter_out2a_tim1 == (B + C) / 10)
      {
        counter_out2a_tim1 = UINT16_MAX;
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
        n1_times_tim1_in2++;
      }
      counter_out2a_tim1++;
      if (n1_times_tim1_in2 == n1)
      {
        counter_out2a_tim1 = 0;
        n1_times_tim1_in2 = 0;
        flag_in2_falling_a_tim1 = 0;
      }
    }
    //------------------------------------------output 2b
    if (flag_in2_rising_b_tim1 == 1)
    {
      if (counter_out2b_tim1_before < D / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim1_before == D / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
        counter_out2b_tim1_before = UINT16_MAX;
        flag_in2_rising_b_tim1 = 0;
      }
      counter_out2b_tim1_before++;
    }
    if (flag_in2_falling_b_tim1 == 1)
    {
      if (counter_out2b_tim1_after < D / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim1_after >= D / 10 && counter_out2b_tim1_after < (D + B) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim1_after >= (D + B) / 10 && counter_out2b_tim1_after < (D + B + C) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim1_after == (D + B + C) / 10)
      {
       counter_out2b_tim1_after = D / 10 - 1;
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
        n2_times_tim1_in2++;
      }
      counter_out2b_tim1_after++;
      if (n2_times_tim1_in2 == n2)
      {
        counter_out2b_tim1_after = 0;
        n2_times_tim1_in2 = 0;
        flag_in2_falling_b_tim1 = 0;
      }
    }
    //-----------------------------------------------------------channel 3
    //------------------------------------------output 3a
    if (flag_in3_falling_a_tim1 == 1)
    {
      if (counter_out3a_tim1 < B / 10)
      {
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 0);
      }
      if (counter_out3a_tim1 >= B / 10 && counter_out3a_tim1 < (B + C) / 10)
      {
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 1);
      }
      if (counter_out3a_tim1 == (B + C) / 10)
      {
        counter_out3a_tim1 = UINT16_MAX;
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 0);
        n1_times_tim1_in3++;
      }
      counter_out3a_tim1++;
      if (n1_times_tim1_in3 == n1)
      {
        counter_out3a_tim1 = 0;
        n1_times_tim1_in3 = 0;
        flag_in3_falling_a_tim1 = 0;
      }
    }
    //------------------------------------------output 3b
    if (flag_in3_rising_b_tim1 == 1)
    {
      if (counter_out3b_tim1_before < D / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
      }
      if (counter_out3b_tim1_before == D / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
        counter_out3b_tim1_before = UINT16_MAX;
        flag_in3_rising_b_tim1 = 0;
      }
      counter_out3b_tim1_before++;
    }
    if (flag_in3_falling_b_tim1 == 1)
    {
      if (counter_out3b_tim1_after < D / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
      }
      if (counter_out3b_tim1_after >= D / 10 && counter_out3b_tim1_after < (D + B) / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
      }
      if (counter_out3b_tim1_after >= (D + B) / 10 && counter_out3b_tim1_after < (D + B + C) / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
      }
      if (counter_out3b_tim1_after == (D + B + C) / 10)
      {
        counter_out3b_tim1_after = D / 10 - 1;
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
        n2_times_tim1_in3++;
      }
      counter_out3b_tim1_after++;
      if (n2_times_tim1_in3 == n2)
      {
        counter_out3b_tim1_after = 0;
        n2_times_tim1_in3 = 0;
        flag_in3_falling_b_tim1 = 0;
      }
    }
    //-----------------------------------------------------------channel 4
    //------------------------------------------output 4a
    if (flag_in4_falling_a_tim1 == 1)
    {
      if (counter_out4a_tim1 < B / 10)
      {
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 0);
      }
      if (counter_out4a_tim1 >= B / 10 && counter_out4a_tim1 < (B + C) / 10)
      {
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 1);
      }
      if (counter_out4a_tim1 == (B + C) / 10)
      {
        counter_out4a_tim1 = UINT16_MAX;
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 0);
        n1_times_tim1_in4++;
      }
      counter_out4a_tim1++;
      if (n1_times_tim1_in4 == n1)
      {
        counter_out4a_tim1 = 0;
        n1_times_tim1_in4 = 0;
        flag_in4_falling_a_tim1 = 0;
      }
    }
    //------------------------------------------output 3b
    if (flag_in4_rising_b_tim1 == 1)
    {
      if (counter_out4b_tim1_before < D / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
      }
      if (counter_out4b_tim1_before == D / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
        counter_out4b_tim1_before = UINT16_MAX;
        flag_in4_rising_b_tim1 = 0;
      }
      counter_out4b_tim1_before++;
    }
    if (flag_in4_falling_b_tim1 == 1)
    {
      if (counter_out4b_tim1_after < D / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
      }
      if (counter_out4b_tim1_after >= D / 10 && counter_out4b_tim1_after < (D + B) / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
      }
      if (counter_out4b_tim1_after >= (D + B) / 10 && counter_out4b_tim1_after < (D + B + C) / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
      }
      if (counter_out4b_tim1_after == (D + B + C) / 10)
      {
        counter_out4b_tim1_after = D / 10 - 1;
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
        n2_times_tim1_in4++;
      }
      counter_out4b_tim1_after++;
      if (n2_times_tim1_in4 == n2)
      {
        counter_out4b_tim1_after = 0;
        n2_times_tim1_in4 = 0;
        flag_in4_falling_b_tim1 = 0;
      }
    }
  }
  //--------------------------------------------------------------------------Timer 2 pattern b
  if (htim->Instance == TIM2)
  {
    //-----------------------------------------------------------output 1a
    if (flag_in1_falling_a_tim2 == 1)
    {
      if (counter_out1a_tim2 < B1 / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
      }
      if (counter_out1a_tim2 >= B1 / 10 && counter_out1a_tim2 < (B1 + C1) / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
      }
      if (counter_out1a_tim2 >= (B1 + C1) / 10 && counter_out1a_tim2 < (B1 + C1 + B2) / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
      }
      if (counter_out1a_tim2 >= (B1 + C1 + B2) / 10 && counter_out1a_tim2 < (B1 + C1 + B2 + C1) / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
      }
      if (counter_out1a_tim2 == (B1 + C1 + B2 + C1) / 10)
      {
        counter_out1a_tim2 = (B1 + C1) / 10 - 1;
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
        n1_times_tim2_in1++;
      }
      counter_out1a_tim2++;
      if (n1_times_tim2_in1 == n1 - 1)
      {
        counter_out1a_tim2 = 0;
        n1_times_tim2_in1 = 0;
        flag_in1_falling_a_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 1b
    if (flag_in1_falling_b_tim2 == 1)
    {
      if (counter_out1b_tim2 < D1 / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim2 >= D1 / 10 && counter_out1b_tim2 < (D1 + E) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim2 >= (D1 + E) / 10 && counter_out1b_tim2 < (B1 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim2 >= (B1 + C1 + D2) / 10 && counter_out1b_tim2 < (B1 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim2 >= (B1 + C1 + D2 + C2) / 10 && counter_out1b_tim2 < (B1 + C1 + B2 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim2 >= (B1 + C1 + B2 + C1 + D2) / 10 && counter_out1b_tim2 < (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim2 == (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        counter_out1b_tim2 = (B1 + C1 + D2 + C2) / 10 - 1;
        n2_times_tim2_in1++;
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }

      counter_out1b_tim2++;
      if (n2_times_tim2_in1 == n2 - 1)
      {
        counter_out1b_tim2 = 0;
        n2_times_tim2_in1 = 0;
        flag_in1_falling_b_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 2a
    if (flag_in2_falling_a_tim2 == 1)
    {
      if (counter_out2a_tim2 < B1 / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
      }
      if (counter_out2a_tim2 >= B1 / 10 && counter_out2a_tim2 < (B1 + C1) / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
      }
      if (counter_out2a_tim2 >= (B1 + C1) / 10 && counter_out2a_tim2 < (B1 + C1 + B2) / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
      }
      if (counter_out2a_tim2 >= (B1 + C1 + B2) / 10 && counter_out2a_tim2 < (B1 + C1 + B2 + C1) / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
      }
      if (counter_out2a_tim2 == (B1 + C1 + B2 + C1) / 10)
      {
        counter_out2a_tim2 = (B1 + C1) / 10 - 1;
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
        n1_times_tim2_in2++;
      }
      counter_out2a_tim2++;
      if (n1_times_tim2_in2 == n1 - 1)
      {
        counter_out2a_tim2 = 0;
        n1_times_tim2_in2 = 0;
        flag_in2_falling_a_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 2b
    if (flag_in2_falling_b_tim2 == 1)
    {
      if (counter_out2b_tim2 < D1 / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim2 >= D1 / 10 && counter_out2b_tim2 < (D1 + E) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim2 >= (D1 + E) / 10 && counter_out2b_tim2 < (B1 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim2 >= (B1 + C1 + D2) / 10 && counter_out2b_tim2 < (B1 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim2 >= (B1 + C1 + D2 + C2) / 10 && counter_out2b_tim2 < (B1 + C1 + B2 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim2 >= (B1 + C1 + B2 + C1 + D2) / 10 && counter_out2b_tim2 < (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim2 == (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        counter_out2b_tim2 = (B1 + C1 + D2 + C2) / 10 - 1;
        n2_times_tim2_in2++;
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }

